(global.webpackJsonp = global.webpackJsonp || []).push([ [ "pages/personal_package/common/vendor" ], {
    1615: function(n) {
        n.exports = JSON.parse('{"tree":{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[],"n":3,"r":10,"t":9}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":13,"t":12}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":6},{"c":[{"c":[{"c":[{"c":[],"n":3,"r":16,"t":15}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":18,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":14},{"c":[{"c":[{"c":[{"c":[],"n":3,"r":20,"t":17}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":21,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":19}],"n":1,"r":-1,"t":5}],"n":2,"r":-1,"t":4},{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[],"n":3,"r":23,"t":9}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":24,"t":15}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":6},{"c":[{"c":[{"c":[{"c":[],"n":3,"r":25,"t":17}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":26,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":19}],"n":1,"r":-1,"t":5}],"n":2,"r":-1,"t":22},{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[],"n":3,"r":28,"t":15}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":29,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":6},{"c":[{"c":[{"c":[{"c":[],"n":3,"r":30,"t":17}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":31,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":19}],"n":1,"r":-1,"t":5}],"n":2,"r":-1,"t":27},{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[],"n":3,"r":33,"t":17}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":34,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":6},{"c":[{"c":[{"c":[{"c":[],"n":3,"r":35,"t":17}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":36,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":19}],"n":1,"r":-1,"t":5}],"n":2,"r":-1,"t":32}],"n":1,"r":-1,"t":3}],"n":2,"r":-1,"t":2},{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[],"n":3,"r":38,"t":15}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":39,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":6},{"c":[{"c":[{"c":[{"c":[],"n":3,"r":40,"t":17}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":42,"t":41}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":19}],"n":1,"r":-1,"t":5}],"n":2,"r":-1,"t":4},{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[],"n":3,"r":43,"t":17}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":44,"t":15}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":6},{"c":[{"c":[{"c":[{"c":[],"n":3,"r":45,"t":17}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":46,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":19}],"n":1,"r":-1,"t":5}],"n":2,"r":-1,"t":22},{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[],"n":3,"r":47,"t":17}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":48,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":6},{"c":[{"c":[{"c":[{"c":[],"n":3,"r":49,"t":17}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":50,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":19}],"n":1,"r":-1,"t":5}],"n":2,"r":-1,"t":27},{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[],"n":3,"r":52,"t":51}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":53,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":6},{"c":[{"c":[{"c":[{"c":[],"n":3,"r":54,"t":17}],"n":2,"r":-1,"t":8},{"c":[{"c":[],"n":3,"r":55,"t":17}],"n":2,"r":-1,"t":11}],"n":1,"r":-1,"t":7}],"n":2,"r":-1,"t":19}],"n":1,"r":-1,"t":5}],"n":2,"r":-1,"t":32}],"n":1,"r":-1,"t":3}],"n":2,"r":-1,"t":37}],"n":1,"r":1,"t":0},"dictionary":{"0":"您的房产在什么时候购买？","1":"本工具内容由法务平台收集提供。","2":"婚前购买","3":"您的房产由谁出资？","4":"一方出资","5":"您的房本登记在谁名下？","6":"一方名下","7":"婚后是否有贷款？","8":"无贷款","9":"您好，根据婚姻法及相关司法解释，您的房屋产权属于“一方所有”。","10":"婚前一方全款购房，登记在一方名下，为一方婚前财产，该房屋产权属于“一方所有”。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","11":"有贷款","12":"您好，根据婚姻法及相关司法解释，您的房屋产权属于“部分共有”。","13":"一方婚前以个人财产买房，支付了首付款并向银行贷款，婚后用夫妻共同财产还贷，房屋登记于首付款支付方名下的，离婚时该不动产由双方协议处理。不能达成协议的，人民法院可以判决该不动产归产权登记一方，尚未归还的贷款为产权登记一方的个人债务。双方婚后共同还贷支付的款项及其相对应财产增值部分双方平均分割，由产权登记一方对另一方进行补偿；\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","14":"对方名下","15":"您好，根据婚姻法及相关司法解释，您的房屋产权属于“或共有”。","16":"以结婚为目的，夫妻一方婚前个人全款出资购买的房屋登记在另一方名下，如果没有证据证明出资方明确表示归登记一方个人所有，离婚时对该房屋一般应按夫妻共同财产处理。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","17":"您好，根据婚姻法及相关司法解释，您的房屋产权属于“共有”。","18":"以结婚为目的，夫妻一方婚前支付首付款购买的房屋登记在另一方名下，婚后夫妻共同还贷，如没有证据证明出资方明确表示归登记一方所有，离婚时对该房屋一般按夫妻共同财产处理。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","19":"双方名下","20":"以结婚为目的，一方出资全款购房，登记在双方名下，视为附条件的赠与，婚姻关系成立时，赠与行为生效。离婚时一般按夫妻共同财产处理。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","21":"以结婚为目的，一方支付购房首付款，婚后共同还贷购房，登记在双名下，视为附条件的赠与，婚姻关系成立时，赠与行为生效。离婚时一般按夫妻共同财产处理。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","22":"一方父母出","23":"婚前一方父母全款买房，登记在一方名下，视为对自己子女的赠与。属于一方婚前财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","24":"一方父母为子女部分出资（首付款）买房，婚后双方共同还贷，房屋登记在出资方子女名下的，该房屋不能认定为夫妻一方个人财产，父母出资部分视为只对自己子女一方的赠与，但父母明确表示赠与双方的除外；\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","25":"以结婚为目的，婚前一方父母出资登记在双方名下，为附条件的赠与，婚姻关系成立时赠与发生效力。离婚时一般认定为夫妻共同财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","26":"一方父母为子女部分出资（首付款）买房，婚后双方共同还贷，房屋登记在双方名下的，房屋应认定为夫妻共同财产，父母出资部分则视为只对自己子女一方的赠与，但父母明确表示赠与双方的除外；\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","27":"双方出资","28":" 婚前双方共同出资购房，付清全部房款，房屋登记在一方名下，如能证明出资情况，则双方对房屋按份共有；如不能证明出资情况，且一方否认另一方购房时有出资，则只能认定为一方的个人财产；\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","29":"双方父母共同为子女出资买房，房屋登记在一方子女名下的，该房屋可认定为双方按照各自婚前双方共同支付首付款，婚后共同还贷，房屋登记在一方名下，为共有财产。若离婚时一方否认另一方购房时出资的，且出资方不能证明出资情况的，则可能会判处归登记一方所有，出资方可主张婚后共同还贷部分的债权返还。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","30":"双方共同出资、登记在双方名下，为双方按份共有财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","31":"双方共同出资、登记在双方名下、婚后双方共同还贷，为双方共有财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","32":"双方父母出","33":"双方父母出资，登记在一方名下，按照双方父母的出资比例按份共有，双方要就出资份额负举证责任。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","34":"双方父母出首付款，登记在一方名下，婚后共同还贷，出资方举证证明出资的，为夫妻共有财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","35":"双方父母出资，登记在双方名下，视为对自己子女的赠与，为夫妻共同财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","36":"双方父母出首付款，登记在双方名下，婚后共同还贷，视为双方父母对夫妻双方的赠与，为夫妻共同财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","37":"婚后购买","38":"婚后夫妻一方以个人婚前财产买房，支付了全部房款，并登记在自己名下的，如并非投资经营行为，属于一方婚前财产的转化，应认定为一方个人财产；\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","39":"婚后夫妻一方以个人婚前财产买房，支付了首付款，并登记在自己名下的，若贷款部分无法证明为个人财产还贷，属于双方共有财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","40":"婚后一方出资，登记在双方名下，视为对夫妻另一方的赠与，为夫妻共同财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","41":"您好，根据婚姻法及相关司法解释，您的房屋产权属于“共同”。","42":"婚后一方支付首付款，登记在双方名下，双方共同还贷，为夫妻共同财产。首付款部分视为对另一方的赠与。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","43":"婚后一方父母出资，登记在子女名下，若无明确表明赠与一方的，为赠与夫妻双方的财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","44":"一方父母为子女部分出资（首付款）买房，双方共同还贷，房屋登记在出资方子女名下的，房屋应认定为夫妻共同财产，父母出资部分视为对双方的赠与，但父母明确表示赠与一方的除外。离婚分割时可以出资父母的子女一方适当多分；\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","45":"婚后一方父母出资，登记在双方名下，视为对夫妻双方的赠与，为共同财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","46":"一方父母为子女部分出资（首付款）买房，双方共同还贷，房屋登记在双方名下的，房屋应认定为夫妻共同财产，父母出资部分视为对双方的赠与，但父母明确表示赠与一方的除外。离婚分割时可以出资父母的子女一方适当多分；\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","47":"婚后双方出资，登记在一方名下，系用共同财产购房，为共同财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","48":"婚后双方出首付款，登记在一方名下，双方共同还贷，为双方共有财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","49":"婚后，双方出资、登记在双方名下，为夫妻共同财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","50":"婚后，双方出首付款、登记在双方名下，双方共同还贷，为夫妻共同财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","51":"您好，根据婚姻法及相关司法解释，您的房屋产权属于“按份共有”。","52":"双方父母共同为子女出资买房，房屋登记在一方子女名下的，该房屋可认定为双方按照各自父母的出资份额按份共有，但当事人另有约定的除外；\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","53":"婚后双方父母出首付款，登记在一方名下，双方共同还贷，为夫妻共同财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","54":"婚后双方父母出资，登记在双方名下，为双方父母对夫妻双方的赠与，为夫妻共同财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。","55":"婚后双方父母出首付款，登记在双方名下，双方共同还贷，为夫妻共同财产。\\n*上述结论仅供参考，如有复杂事宜请咨询专业律师。"}}');
    },
    "179d": function(n, t, r) {
        Object.defineProperty(t, "__esModule", {
            value: !0
        }), t.selectQuestion = void 0;
        var c = r("dd5c"), e = r("1615"), o = (0, c.handleSelectQuestion)(e.dictionary, e.tree);
        t.selectQuestion = o;
    },
    2055: function(n, t, r) {
        Object.defineProperty(t, "__esModule", {
            value: !0
        }), t.default = void 0;
        var c = {
            verify_mobile: ""
        };
        t.default = c;
    },
    "364e": function(n, t, r) {
        Object.defineProperty(t, "__esModule", {
            value: !0
        }), t.selectQuestion = void 0;
        var c = r("dd5c"), e = r("55b8"), o = (0, c.handleSelectQuestion)(e.dictionary, e.tree);
        t.selectQuestion = o;
    },
    3892: function(n, t, r) {
        Object.defineProperty(t, "__esModule", {
            value: !0
        }), t.default = void 0;
        var c = r("64ed"), e = {
            getExchangeInfo: function() {
                return (0, c.getV1)("exchange_gold_coins/new", {
                    loading: !1
                });
            },
            exchangeCoins: function(n) {
                return (0, c.postV1)("exchange_gold_coins", {
                    gold_coins: n
                }, {
                    loading: !0
                });
            },
            pay: function(n) {
                return (0, c.postV1)("wxpay_orders", {
                    appid: "wx43cd50f11d5cf374",
                    trade_type: "JSAPI",
                    amount: n,
                    spbill_create_ip: ""
                }, {
                    loading: !0
                });
            },
            getRecords: function() {
                return (0, c.getV1)("gold_coin_journals", {
                    loading: !0
                });
            }
        };
        t.default = e;
    },
    "55b8": function(n) {
        n.exports = JSON.parse('{"tree":{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[{"c":[],"n":3,"r":11,"t":10}],"n":2,"r":-1,"t":9},{"c":[{"c":[],"n":3,"r":14,"t":13}],"n":2,"r":-1,"t":12},{"c":[{"c":[],"n":3,"r":17,"t":16}],"n":2,"r":-1,"t":15}],"n":1,"r":8,"t":7}],"n":2,"r":-1,"t":6},{"c":[{"c":[{"c":[{"c":[],"n":3,"r":21,"t":20}],"n":2,"r":-1,"t":19},{"c":[{"c":[],"n":3,"r":21,"t":20}],"n":2,"r":-1,"t":22},{"c":[{"c":[],"n":3,"r":21,"t":20}],"n":2,"r":-1,"t":23}],"n":1,"r":8,"t":7}],"n":2,"r":-1,"t":18},{"c":[{"c":[{"c":[{"c":[],"n":3,"r":27,"t":26}],"n":2,"r":-1,"t":25},{"c":[{"c":[],"n":3,"r":27,"t":29}],"n":2,"r":-1,"t":28}],"n":1,"r":8,"t":7}],"n":2,"r":-1,"t":24}],"n":1,"r":5,"t":4}],"n":2,"r":-1,"t":3}],"n":1,"r":-1,"t":2}],"n":2,"r":-1,"t":1},{"c":[{"c":[],"n":3,"r":32,"t":31}],"n":2,"r":-1,"t":30},{"c":[{"c":[],"n":3,"r":35,"t":34}],"n":2,"r":-1,"t":33}],"n":1,"r":-1,"t":0},"dictionary":{"0":"房屋所有权人去世，目前您手中持有？\\n","1":"无遗赠抚养协议及遗嘱","2":"在无遗赠抚养协议及遗嘱的情况下，应当按照法定继承的顺序继承财产。","3":"法定继承","4":"您和已去世的房屋所有权人的关系属于哪一顺位？","5":"在无遗赠抚养协议及遗嘱的情况下，应当按照法定继承。为确认您的法定继承顺序，请您按照选项提示进行选择。","6":"法定继承第一顺位：配偶、子女、父母","7":"您的身份是？","8":"根据您和已去世房屋产权人之间的关系选择。","9":"配偶","10":"根据继承法相关规定，在一般情况下，如您作为被继承人的配偶，在被继承人还有其他第一顺位法定继承人的情况下，就被继承人生前单独所有的份额，您应和其他第一顺位法定继承人平分份额。如房屋属于被继承人单独所有，除您外，被继承人去世时，还有儿子，则继承后，您享有1/2份额，儿子享有1/2份额。如房屋属于您与被继承人夫妻共同财产，则继承后，您享有3/4份额，儿子享有1/4份额。","11":"1）仅限于一般平均分配财产的情况。不涉及丧偶儿媳和丧偶女婿尽到赡养义务的情形，不涉及需对继承人予以照顾的情形，可少分不分财产的情形。\\n2）仅限于房屋产权人去世时其父亲/母亲已去世的情况。如其父亲/母亲在产权人去世后方去世，则分配财产时，应当计算分配给父母的份额，该份额由父母的法定继承人予以继承。\\n*复杂事项建议咨询律师。","12":"子女","13":"根据继承法相关规定，在一般情况下，如您作为已去世房屋产权人的儿子/女儿，在房屋产权人还有其他第一顺位继承人的情况下，就去世人生前享有的房产份额，您应和其他继承人平分份额。如房屋属于产权人单独所有，除您外，房屋产权人去世时，还有配偶和女儿，则您分得1/3份额，配偶分得1/3份额，女儿分得1/3份额。","14":"上述结果：\\n1）仅限于一般平均分配财产的情况。不涉及丧偶儿媳和丧偶女婿尽到赡养义务的情形，不涉及需对继承人予以照顾的情形，可少分不分财产的情形。\\n3）仅限于房屋产权人去世时其父亲/母亲已去世的情况。如其父亲/母亲在产权人去世后方去世，则分配财产时，应当计算分配给父母的份额，该份额由父母的法定继承人予以继承。\\n*复杂事项建议咨询律师。","15":"父母","16":"根据继承法相关规定，在一般情况下，如您作为已去世房屋产权人的父亲（或母亲），在房屋产权人还有第一顺位继承人的情况下，就去世人生前享有的房产份额，您应和其他继承人平分份额。如房屋属于产权人单独所有，除您外，房屋产权人去世时，还有母亲（或父亲）、配偶和儿子，则您分得1/4份额，母亲（或父亲）分得1/4份额，配偶分得1/4份额，儿子分得1/4份额。","17":"上述结果：\\n1）仅限于一般平均分配财产的情况。不涉及丧偶儿媳和丧偶女婿尽到赡养义务的情形，不涉及需对继承人予以照顾的情形，可少分不分财产的情形。\\n复杂事项建议咨询律师。","18":"法定继承第二顺位：兄弟姐妹、祖父母、外祖父母","19":"兄弟姐妹","20":"根据继承法相关规定，只有在房屋产权人去世时，父母已去世，且无配偶、无子女的情况下，您方能取得继承权，如尚有第一顺位继承人存在，则您无法取得继承权。继承的份额，一般情况下应当和其他第二顺位继承人平分。","21":"根据继承法相关规定，在被继承人去世时，如尚有第一顺位继承人，则第二顺位继承人无法取得继承权","22":"祖父母","23":"外祖父母","24":"其他：孙子女、外孙子女","25":"孙子女","26":"根据继承法相关规定，只有房屋产权人去世前，您的父亲（去世产权人的子女）已去世的情况下，您方能代替您的父亲继承其有权继承的份额。 如A单独所有一房屋。A有B和C两个儿子，B有1个女儿D。2005年B去世，2006年A去世。关于A去世后房屋的产权份额归属，应当B和C各有1/2份额，因B先于A去世，故其1/2份额由D继承。","27":"*复杂事项建议咨询律师。","28":"外孙子女","29":"根据继承法相关规定，只有房屋产权人去世前，您的母亲（去世产权人的子女）已去世的情况下，您方能代替您的母亲继承其有权继承的份额。 如A单独所有一房屋。A有B和C两个儿子，B有1个女儿D。2005年B去世，2006年A去世。关于A去世后房屋的产权份额归属，应当B和C各有1/2份额，因B先于A去世，故其1/2份额由D继承。","30":"遗赠抚养协议","31":"根据继承法相关规定，如您持有《遗赠抚养协议》，则房屋归属应当依照协议约定执行。","32":"遗赠抚养协议是指受抚养人（公民）和抚养人之间订立的关于抚养人承担受抚养人的生养死葬义务，受抚养人将自己所拥有的财产遗赠给抚养人的协议。","33":"遗嘱","34":"根据继承法相关规定，如您持有《遗嘱》，在无《遗赠抚养协议》的情况下，则房屋归属应当依照遗嘱办理。","35":"根据继承法相关规定，立遗嘱的形式包括：公证遗嘱、自书遗嘱、代书遗嘱、录音遗嘱、口头遗嘱。\\n1）公证遗嘱：由遗嘱人经公证机关办理。\\n2）自书遗嘱：由遗嘱人亲笔书写、签名，注明年、月、日。\\n3）代书遗嘱：应当有两个以上见证人在场见证，由其中一人代书，注明年、月、日，并由代书人、其他见证人和遗嘱人签名。\\n4）录音遗嘱：以录音形式立的遗嘱，应当有两个以上见证人在场见证。\\n5）口头遗嘱：遗嘱人在危急情况下，可以立口头遗嘱。口头遗嘱应当有两个以上见证人在场见证。危急情况解除后，遗嘱人能够用书面或者录音形式立遗嘱的，所立的口头遗嘱无效。\\n*温馨提示：如未严格按照法律规定的遗嘱形式订立遗嘱，一旦发生纠纷，有可能因遗嘱不符合法律规定的形式而被法院认定无效，从而需按照法定继承的顺序继承财产。为确保遗嘱的有效性，建议您在立遗嘱前向专业律师咨询。"}}');
    },
    a9dd: function(n, t, r) {
        Object.defineProperty(t, "__esModule", {
            value: !0
        }), t.default = void 0;
        var c = function(n) {
            return n && n.__esModule ? n : {
                default: n
            };
        }(r("12bf")), e = {
            onPullDownRefresh: function() {
                this.loading || (this.page = 1, this.getData());
            },
            methods: {
                goCard: function(n) {
                    var t = n.currentTarget.dataset.id;
                    wx.navigateTo({
                        url: "/pages/consultants/card/main?id=".concat(t)
                    });
                },
                selectCard: function(n) {
                    var t = n.currentTarget.dataset, r = t.id;
                    t.index, c.default.selectCard(r).then(this.getData);
                }
            }
        };
        t.default = e;
    },
    b4fa: function(n, t, r) {
        Object.defineProperty(t, "__esModule", {
            value: !0
        }), t.default = void 0;
        var c = r("64ed"), e = {
            setFeedbacks: function(n) {
                return (0, c.postV1)("feedbacks", n, {
                    loading: !0
                });
            }
        };
        t.default = e;
    },
    bf76: function(n, t, r) {
        Object.defineProperty(t, "__esModule", {
            value: !0
        }), t.default = void 0;
        t.default = function(n) {
            return n.new_house_notification_policy;
        };
    },
    c147: function(n, t, r) {
        Object.defineProperty(t, "__esModule", {
            value: !0
        }), t.default = void 0;
        var c = r("64ed"), e = {
            getPosition: function() {
                return (0, c.getV1)("consultant_bidding_positions", {
                    loading: !0
                });
            },
            bidding: function(n) {
                return (0, c.postV1)("consultant_biddings", n, {
                    loading: !0
                });
            }
        };
        t.default = e;
    },
    dd5c: function(n, t, r) {
        Object.defineProperty(t, "__esModule", {
            value: !0
        }), t.handleSelectQuestion = void 0;
        t.handleSelectQuestion = function(n, t) {
            return function() {
                var r = arguments.length > 0 && void 0 !== arguments[0] ? arguments[0] : t, c = r.c, e = {};
                return e.question = n[r.t], e.end = !c.length, e.end ? (e.result = n[r.t], e.desc = n[r.r]) : e.answers = c.map(function(t) {
                    var r = t.t, c = t.r, e = t.c;
                    return {
                        question_index: r,
                        desc: n[c],
                        content: n[r],
                        tree: e && 1 === e.length ? e[0] : {}
                    };
                }), e;
            };
        };
    }
} ]);